taurus/onecem_file_up.yaml
execution:
  - concurrency: ${count}
    scenario: Test Scenario

modules:
  jmeter:
    properties:
      my-hostname: www.pre-test.com
      username: chaoying
      log_level.jmeter: WARN
      log_level.jmeter.threads: DEBUG
      concurrency-chishu: 10
    system-properties:
      sun.net.http.allowRestrictedHeaders: "true"
    gui: true
scenarios:
  Test Scenario:
    requests:
      - url: https://www.baidu.com?data=${subdir}
    properties:
      my_hold: 15   # scenario-level property has priority
      sub_dir: contacts
    variables:
      subdir: contacts
      count: 12